# HWallHeight

## Description
Procedure HWallHeight sets the wall heights of the referenced wall object.&lt;BR&gt;

```pascal
PROCEDURE HWallHeight(
				wallHd              : HANDLE;
				startHeightDistance : REAL (Coordinate);
				endHeightDistance   : REAL (Coordinate));
```

```python

def vs.HWallHeight(wallHd, startHeightDistance, endHeightDistance):
    return None
```

## Parameters
|Name|Type|Description|
|---|---|---|
|wallHd|HANDLE|Handle to wall.|
|startHeightDistance|REAL (Coordinate)|New start height of wall.|
|endHeightDistance|REAL (Coordinate)|New end height of wall.|

## Version
```diff
- HWallHeight is obsolete as of Vectorworks 2012
```

Availability: from MiniCAD6.0
## Category
* Objects - Walls